Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64MC510A.h
#define _DTCON2_DTS3I_POSITION                   0x00000004
#define _DTCON2_DTS3I_MASK                       0x00000010
#define _DTCON2_DTS3I_LENGTH                     0x00000001

#define _DTCON2_DTS3A_POSITION                   0x00000005
#define _DTCON2_DTS3A_MASK                       0x00000020
#define _DTCON2_DTS3A_LENGTH                     0x00000001

#define _DTCON2_DTS4I_POSITION                   0x00000006
#define _DTCON2_DTS4I_MASK                       0x00000040
#define _DTCON2_DTS4I_LENGTH                     0x00000001

#define _DTCON2_DTS4A_POSITION                   0x00000007
#define _DTCON2_DTS4A_MASK                       0x00000080
#define _DTCON2_DTS4A_LENGTH                     0x00000001

#define _P1DTCON2_DTS1I_POSITION                 0x00000000
#define _P1DTCON2_DTS1I_MASK                     0x00000001
#define _P1DTCON2_DTS1I_LENGTH                   0x00000001

#define _P1DTCON2_DTS1A_POSITION                 0x00000001
#define _P1DTCON2_DTS1A_MASK                     0x00000002
#define _P1DTCON2_DTS1A_LENGTH                   0x00000001

#define _P1DTCON2_DTS2I_POSITION                 0x00000002
#define _P1DTCON2_DTS2I_MASK                     0x00000004
#define _P1DTCON2_DTS2I_LENGTH                   0x00000001

#define _P1DTCON2_DTS2A_POSITION                 0x00000003
#define _P1DTCON2_DTS2A_MASK                     0x00000008
#define _P1DTCON2_DTS2A_LENGTH                   0x00000001

#define _P1DTCON2_DTS3I_POSITION                 0x00000004
#define _P1DTCON2_DTS3I_MASK                     0x00000010
#define _P1DTCON2_DTS3I_LENGTH                   0x00000001

#define _P1DTCON2_DTS3A_POSITION                 0x00000005
#define _P1DTCON2_DTS3A_MASK                     0x00000020
#define _P1DTCON2_DTS3A_LENGTH                   0x00000001

#define _P1DTCON2_DTS4I_POSITION                 0x00000006
#define _P1DTCON2_DTS4I_MASK                     0x00000040
#define _P1DTCON2_DTS4I_LENGTH                   0x00000001

#define _P1DTCON2_DTS4A_POSITION                 0x00000007
#define _P1DTCON2_DTS4A_MASK                     0x00000080
#define _P1DTCON2_DTS4A_LENGTH                   0x00000001

#define _FLTACON_FAEN1_POSITION                  0x00000000
#define _FLTACON_FAEN1_MASK                      0x00000001
#define _FLTACON_FAEN1_LENGTH                    0x00000001

#define _FLTACON_FAEN2_POSITION                  0x00000001
#define _FLTACON_FAEN2_MASK                      0x00000002
#define _FLTACON_FAEN2_LENGTH                    0x00000001

#define _FLTACON_FAEN3_POSITION                  0x00000002
#define _FLTACON_FAEN3_MASK                      0x00000004
#define _FLTACON_FAEN3_LENGTH                    0x00000001

#define _FLTACON_FAEN4_POSITION                  0x00000003
#define _FLTACON_FAEN4_MASK                      0x00000008
#define _FLTACON_FAEN4_LENGTH                    0x00000001

#define _FLTACON_FLTAM_POSITION                  0x00000007
#define _FLTACON_FLTAM_MASK                      0x00000080
#define _FLTACON_FLTAM_LENGTH                    0x00000001

#define _FLTACON_FAOV1L_POSITION                 0x00000008
#define _FLTACON_FAOV1L_MASK                     0x00000100
#define _FLTACON_FAOV1L_LENGTH                   0x00000001

#define _FLTACON_FAOV1H_POSITION                 0x00000009
#define _FLTACON_FAOV1H_MASK                     0x00000200
#define _FLTACON_FAOV1H_LENGTH                   0x00000001

#define _FLTACON_FAOV2L_POSITION                 0x0000000A
#define _FLTACON_FAOV2L_MASK                     0x00000400
#define _FLTACON_FAOV2L_LENGTH                   0x00000001

#define _FLTACON_FAOV2H_POSITION                 0x0000000B
#define _FLTACON_FAOV2H_MASK                     0x00000800
#define _FLTACON_FAOV2H_LENGTH                   0x00000001

#define _FLTACON_FAOV3L_POSITION                 0x0000000C
#define _FLTACON_FAOV3L_MASK                     0x00001000
#define _FLTACON_FAOV3L_LENGTH                   0x00000001

#define _FLTACON_FAOV3H_POSITION                 0x0000000D
#define _FLTACON_FAOV3H_MASK                     0x00002000
#define _FLTACON_FAOV3H_LENGTH                   0x00000001

#define _FLTACON_FAOV4L_POSITION                 0x0000000E
#define _FLTACON_FAOV4L_MASK                     0x00004000
#define _FLTACON_FAOV4L_LENGTH                   0x00000001

#define _FLTACON_FAOV4H_POSITION                 0x0000000F
#define _FLTACON_FAOV4H_MASK                     0x00008000
#define _FLTACON_FAOV4H_LENGTH                   0x00000001

#define _P1FLTACON_FAEN1_POSITION                0x00000000
#define _P1FLTACON_FAEN1_MASK                    0x00000001
#define _P1FLTACON_FAEN1_LENGTH                  0x00000001

#define _P1FLTACON_FAEN2_POSITION                0x00000001
#define _P1FLTACON_FAEN2_MASK                    0x00000002
#define _P1FLTACON_FAEN2_LENGTH                  0x00000001

#define _P1FLTACON_FAEN3_POSITION                0x00000002
#define _P1FLTACON_FAEN3_MASK                    0x00000004
#define _P1FLTACON_FAEN3_LENGTH                  0x00000001

#define _P1FLTACON_FAEN4_POSITION                0x00000003
#define _P1FLTACON_FAEN4_MASK                    0x00000008
#define _P1FLTACON_FAEN4_LENGTH                  0x00000001

#define _P1FLTACON_FLTAM_POSITION                0x00000007
#define _P1FLTACON_FLTAM_MASK                    0x00000080
#define _P1FLTACON_FLTAM_LENGTH                  0x00000001

#define _P1FLTACON_FAOV1L_POSITION               0x00000008
#define _P1FLTACON_FAOV1L_MASK                   0x00000100
#define _P1FLTACON_FAOV1L_LENGTH                 0x00000001

#define _P1FLTACON_FAOV1H_POSITION               0x00000009
#define _P1FLTACON_FAOV1H_MASK                   0x00000200
#define _P1FLTACON_FAOV1H_LENGTH                 0x00000001

#define _P1FLTACON_FAOV2L_POSITION               0x0000000A
#define _P1FLTACON_FAOV2L_MASK                   0x00000400
#define _P1FLTACON_FAOV2L_LENGTH                 0x00000001

#define _P1FLTACON_FAOV2H_POSITION               0x0000000B
#define _P1FLTACON_FAOV2H_MASK                   0x00000800
#define _P1FLTACON_FAOV2H_LENGTH                 0x00000001

#define _P1FLTACON_FAOV3L_POSITION               0x0000000C
#define _P1FLTACON_FAOV3L_MASK                   0x00001000
#define _P1FLTACON_FAOV3L_LENGTH                 0x00000001

#define _P1FLTACON_FAOV3H_POSITION               0x0000000D
#define _P1FLTACON_FAOV3H_MASK                   0x00002000
#define _P1FLTACON_FAOV3H_LENGTH                 0x00000001

#define _P1FLTACON_FAOV4L_POSITION               0x0000000E
#define _P1FLTACON_FAOV4L_MASK                   0x00004000
#define _P1FLTACON_FAOV4L_LENGTH                 0x00000001

#define _P1FLTACON_FAOV4H_POSITION               0x0000000F
#define _P1FLTACON_FAOV4H_MASK                   0x00008000
#define _P1FLTACON_FAOV4H_LENGTH                 0x00000001

#define _FLTBCON_FBEN1_POSITION                  0x00000000
#define _FLTBCON_FBEN1_MASK                      0x00000001
#define _FLTBCON_FBEN1_LENGTH                    0x00000001

#define _FLTBCON_FBEN2_POSITION                  0x00000001
#define _FLTBCON_FBEN2_MASK                      0x00000002
#define _FLTBCON_FBEN2_LENGTH                    0x00000001

#define _FLTBCON_FBEN3_POSITION                  0x00000002
#define _FLTBCON_FBEN3_MASK                      0x00000004
#define _FLTBCON_FBEN3_LENGTH                    0x00000001

